NextFOAM-2409/tutorials/multiphase/icoReactingMultiphaseInterFoam/oxideFormation/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1013.15;

boundaryField
{
    bottomInlet
    {
        type            fixedValue;
        value           $internalField;
    }

    topOutlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }

    "(left|right|front|back|bottomLeft|bottomRight)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
